'use client'

import { useState } from "react";

export const Mail = ()=> {
    const [telegram, setTelegram] = useState("");
    const [error, setError] = useState("");

    const handleSubmit = (e: React.FormEvent<HTMLFormElement>) => {
        e.preventDefault();
        if (!telegram.trim()) {
            setError("Пожалуйста, укажите ссылку на ваш Telegram.");
            return;
        }

        setError("");
        // тут можно добавить отправку формы
        console.log("Форма отправлена!");
    };
    return(
        <div className="max-w-[1437px] w-full mx-auto">
        <div id="mail" className="mb-[55px] mail_container justify-between    relative flex  h-[544px] overflow-hidden bg-[#FFFFFF] rounded-[25px] py-[47px] px-[59px] mx-[58px] mt-[118px]">

<svg className="absolute left-0 bottom-[-20px]  w-full  aspect-[1/.3]"   viewBox="0 0 1318 394" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M0 167.332V369C0 382.807 11.1929 394 25 394H1292.5C1306.31 394 1317.5 382.859 1317.5 369.052L1317.5 331.761C1317.5 258.928 1317.5 155.046 1317.5 138C1317.5 109.189 1240.5 0.499956 1111.5 0.5C880.41 0.500078 798.5 138 604.5 180C279.282 250.408 116.625 185.15 35.1896 145.406C18.7349 137.376 0 149.022 0 167.332Z" fill="#0F72EB"/>
</svg>


<div className="flex flex-col  h-full justify-between z-[9999999]">
<div>
    <div><h2 className="gradient text-[52px] text-white max-w-[495px] w-full font-[Mont] font-[900]">Расскажите нам
    о вашей идее</h2></div>
    <div><p className="text-[#333333] text-[23px] max-w-[440px] w-full ">А мы подберем и реализуем решение, которое будет работать на вас!</p></div>
</div>
<div className="flex flex-col gap-[8px] contacts cursor-pointer" onClick={()=> {
    window.open('https://t.me/botstudiooo','_blank')
}}>
    <div className="flex items-center gap-[15px]">
    <svg className=" logo" width="35" height="35" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
<circle cx="17.5227" cy="17.5227" r="17.5227" fill="#FEFEFE"/>
<path d="M17.4152 8.11149C17.1831 8.13324 16.8097 8.32539 16.632 8.51754C16.342 8.82209 16.2477 9.31153 16.4 9.71759C16.4979 9.97863 16.7227 10.265 16.9293 10.3919L17.0852 10.4862L17.0889 11.3056V12.1286L15.3595 12.1467C13.2458 12.1684 13.0972 12.1866 12.5026 12.531C12.1074 12.7594 11.7449 13.1292 11.5455 13.5062C11.317 13.9522 11.2482 14.2604 11.2264 14.9673L11.2047 15.5728L10.7116 15.5873C10.0409 15.6054 9.91397 15.6779 9.83784 16.084C9.79071 16.3414 9.79071 18.6037 9.83784 18.7777C9.9321 19.1185 10.1931 19.2418 10.8167 19.2418H11.2047L11.2264 20.0467C11.2373 20.4926 11.2554 20.9023 11.2699 20.9639C11.3751 21.486 11.7014 22.0624 12.0893 22.4105C12.4736 22.7549 13.021 23.016 13.4996 23.0848C13.6482 23.1066 15.3051 23.1211 17.5892 23.1211C21.2364 23.1211 21.4467 23.1211 21.7875 23.0522C22.5344 22.9072 22.9767 22.6425 23.4407 22.0552C23.6438 21.7978 23.7888 21.4969 23.8686 21.1524C23.9447 20.8225 24.0353 19.6442 23.9991 19.3977L23.9773 19.2418H24.4341C24.8438 19.2418 24.9018 19.2345 25.065 19.1512C25.3804 18.9916 25.3731 19.0315 25.3731 17.429C25.3731 16.1057 25.3695 16.026 25.3006 15.8918C25.1665 15.6308 25.0904 15.5982 24.5175 15.5873L24.0136 15.5728V15.3154C24.0136 14.6882 23.8867 14.0029 23.7054 13.6404C23.3574 12.937 22.7555 12.4512 21.9833 12.2482C21.5954 12.1467 21.3851 12.1358 19.6557 12.1358H18.104V11.3092V10.4862L18.2345 10.3992C18.3034 10.3484 18.4339 10.2324 18.5209 10.1345C18.9632 9.64145 18.9306 8.86922 18.4484 8.44503C18.1294 8.16587 17.8357 8.06798 17.4152 8.11149ZM20.66 15.0036C21.0914 15.0833 21.4322 15.3553 21.6461 15.7903C21.7331 15.9716 21.7476 16.0405 21.7476 16.3414C21.7476 16.6604 21.7368 16.7076 21.628 16.9287C21.4322 17.3312 21.0189 17.643 20.602 17.701C20.3989 17.73 20.0509 17.6502 19.8551 17.5269C19.0865 17.0411 18.9451 16.0804 19.547 15.4314C19.7681 15.1921 20.0183 15.0435 20.2757 15C20.3663 14.9855 20.4425 14.971 20.4461 14.9673C20.4461 14.9673 20.544 14.9818 20.66 15.0036ZM15.2217 15.1087C15.5408 15.2646 15.8344 15.5873 15.9504 15.9136C16.0338 16.1492 16.0266 16.5843 15.9323 16.7946C15.6713 17.3819 15.113 17.7336 14.58 17.6466C13.7316 17.5124 13.2349 16.7257 13.5032 15.9353C13.641 15.522 13.931 15.2066 14.3045 15.0688C14.5728 14.971 14.9752 14.9855 15.2217 15.1087ZM20.5983 19.695C20.9065 19.9742 20.8558 20.4527 20.4968 20.6376C20.3482 20.7138 14.9389 20.721 14.7577 20.6412C14.6018 20.576 14.4567 20.402 14.4277 20.2424C14.3806 20.0032 14.5256 19.6769 14.7105 19.6044C14.7504 19.5862 16.0628 19.5717 17.6218 19.5717L20.4606 19.5681L20.5983 19.695Z" fill="url(#paint0_linear_79_1430)"/>
<path d="M7.89469 12.8535C7.85843 12.8608 7.7823 12.8825 7.73154 12.9006C7.61553 12.9478 3.92113 16.7582 3.68547 17.0736C3.58396 17.215 3.5477 17.3818 3.59846 17.5087C3.63472 17.6066 4.50121 18.5673 5.36046 19.4592C5.86803 19.9885 6.69465 20.8695 7.20584 21.4242C7.6409 21.9028 7.65541 21.9064 8.36601 21.8738C8.94246 21.8484 9.08748 21.7976 9.10561 21.62C9.12374 21.4822 9.08748 21.3553 9.01135 21.2756C8.97872 21.2429 8.84457 21.0979 8.71768 20.9602C8.58716 20.8224 8.2935 20.5142 8.06146 20.2749C7.82943 20.0356 7.33274 19.5136 6.95568 19.1148C6.57863 18.716 6.06381 18.1758 5.8064 17.9147C5.55261 17.6501 5.34233 17.418 5.34233 17.3927C5.34233 17.3455 5.57799 17.0954 8.00708 14.5648C8.26812 14.2965 8.61979 13.9158 8.79744 13.72C9.07298 13.4046 9.11286 13.3466 9.11286 13.2306C9.10923 12.9514 8.94246 12.868 8.38051 12.8535C8.1521 12.8463 7.93457 12.8463 7.89469 12.8535Z" fill="url(#paint1_linear_79_1430)"/>
<path d="M26.3445 12.937C26.2502 12.966 26.2176 12.9986 26.1849 13.111C26.1052 13.3829 26.0145 13.2705 27.9832 15.3842C28.5198 15.9606 29.1144 16.5951 29.3065 16.7945C29.495 16.9939 29.6981 17.2078 29.7561 17.2731L29.8612 17.3891L29.4479 17.835C29.2195 18.0779 28.9113 18.4115 28.7591 18.571C28.6068 18.7305 28.2732 19.0895 28.0158 19.3686C27.4756 19.9523 26.91 20.5505 26.504 20.9602C26.3481 21.1197 26.2031 21.2865 26.1849 21.3336C26.1269 21.4895 26.1487 21.6599 26.2393 21.7687L26.3263 21.8702H26.9427C27.6605 21.8702 27.5336 21.9355 28.1246 21.2901C28.498 20.8805 29.408 19.9088 30.7821 18.4477C31.2063 17.9982 31.5797 17.5776 31.6087 17.5124C31.7175 17.284 31.7138 17.2803 29.6836 15.1268C29.3645 14.7896 29.0056 14.4053 28.886 14.2748C28.1282 13.4482 27.7874 13.1037 27.6134 12.9877C27.4901 12.9007 27.4575 12.8971 26.9717 12.9007C26.6889 12.9007 26.4097 12.9188 26.3445 12.937Z" fill="url(#paint2_linear_79_1430)"/>
<defs>
<linearGradient id="paint0_linear_79_1430" x1="9.80249" y1="15.6113" x2="25.3732" y2="15.6113" gradientUnits="userSpaceOnUse">
<stop stopColor="#0F72EB"/>
<stop offset="0.495192" stopColor="#00B0F2"/>
<stop offset="1" stopColor="#0F72EB"/>
</linearGradient>
<linearGradient id="paint1_linear_79_1430" x1="3.57568" y1="17.3668" x2="9.11286" y2="17.3668" gradientUnits="userSpaceOnUse">
<stop stopColor="#0F72EB"/>
<stop offset="0.495192" stopColor="#00B0F2"/>
<stop offset="1" stopColor="#0F72EB"/>
</linearGradient>
<linearGradient id="paint2_linear_79_1430" x1="26.1523" y1="17.3859" x2="31.6454" y2="17.3859" gradientUnits="userSpaceOnUse">
<stop stopColor="#0F72EB"/>
<stop offset="0.495192" stopColor="#00B0F2"/>
<stop offset="1" stopColor="#0F72EB"/>
</linearGradient>
</defs>
</svg>

        <h3 className="font-[400] text-[#FFFFFF] text-[21px] font-[Mont]">Bot Studio </h3>
    </div>
    <div><span className="text-[#FFFFFF] text-[16px] ">Официальный канал в Telegram </span></div>
</div>
</div>


<div className="z-[999999999]">
    <div><h1 className="max-w-[498px] w-full font-[700] text-[#333333] text-[23px] font-[Mont]">Свяжемся с вами, чтобы уточнить детали
    вашей задумки</h1></div>
    <form onSubmit={handleSubmit} noValidate>
  <div className="w-full mt-[13px]">
    <input className="outline-none bg-[#F2F2F2] rounded-[30px] py-[19px] px-[29px] w-full" type="text" placeholder="Ваше ФИО" />
  </div>
  <div className="w-full ">
    <input
      className="mt-[14px] outline-none bg-[#F2F2F2] rounded-[30px] py-[19px] px-[29px] w-full"
      type="text"
      placeholder="Ссылка на ваш профиль в Telegram"
      value={telegram}
      onChange={(e) => setTelegram(e.target.value)}
    />
    {error && <p className="text-red-500 text-sm mt-1">{error}</p>}
  </div>
  <div className="">
    <textarea className="mt-[13px] h-[136px] bg-[#F2F2F2] rounded-[30px] py-[19px] px-[29px] w-full resize-none outline-none" placeholder="Опишите вашу идею или задачу"></textarea>
  </div>
  <div className="">
    <button type="submit" className="hover:text-[#0F72EB] mt-[32px] w-[184px] text-[#333333] font-[600] text-[14px] bg-[#FFFFFF] rounded-[20px] font-[Mont] py-[9px] px-[31px]">
      Отправить
    </button>
  </div>
</form>

    <div className="mt-[3px] "><span className="italic text-[#FFFFFF] text-[10px] opacity-75">Нажимая “Отправить” вы соглашаетесь с Политика в отношении обработки персональных данных</span></div>
</div>

        </div>
        </div>
    )
}